output_7_render_perf/onload-result-go-chromedp.log
Go PDF Service (chromedp) Headers:
==================================
HTTP/1.1 200 OK
Content-Length: 950
Content-Type: application/pdf
X-Browser-Product: 1.3
X-Browser-Protocolversion: Chrome/141.0.7378.4
X-Browser-Revision: @e6c0fee546ab31f9b21af777cb3083143551ab0f
Date: Tue, 02 Sep 2025 11:08:05 GMT



Performance Metrics:
===================
Container image size: 366MB
Average startup time: 256ms (10 iterations)
Memory usage (before load test): 203MB
Memory usage (after single PDF): 270MB
Memory increase from single PDF: +67MB


Load Test Results:
==================
Running 300s test @ http://127.0.0.1:5011/pdf
3 connections with 3 pipelining factor


┌─────────┬──────┬───────┬────────┬────────┬─────────┬──────────┬────────┐
│ Stat    │ 2.5% │ 50%   │ 97.5%  │ 99%    │ Avg     │ Stdev    │ Max    │
├─────────┼──────┼───────┼────────┼────────┼─────────┼──────────┼────────┤
│ Latency │ 3 ms │ 50 ms │ 105 ms │ 198 ms │ 53.6 ms │ 42.95 ms │ 497 ms │
└─────────┴──────┴───────┴────────┴────────┴─────────┴──────────┴────────┘
┌───────────┬─────────┬─────────┬────────┬────────┬────────┬─────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%    │ 97.5%  │ Avg    │ Stdev   │ Min     │
├───────────┼─────────┼─────────┼────────┼────────┼────────┼─────────┼─────────┤
│ Req/Sec   │ 3       │ 3       │ 3      │ 3      │ 3      │ 0       │ 3       │
├───────────┼─────────┼─────────┼────────┼────────┼────────┼─────────┼─────────┤
│ Bytes/Sec │ 39.4 kB │ 41.7 kB │ 111 kB │ 118 kB │ 101 kB │ 20.7 kB │ 3.58 kB │
└───────────┴─────────┴─────────┴────────┴────────┴────────┴─────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 299

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 1            │
├────────────┼──────────────┤
│ 0.01       │ 1            │
├────────────┼──────────────┤
│ 0.1        │ 1            │
├────────────┼──────────────┤
│ 1          │ 1            │
├────────────┼──────────────┤
│ 2.5        │ 3            │
├────────────┼──────────────┤
│ 10         │ 10           │
├────────────┼──────────────┤
│ 25         │ 25           │
├────────────┼──────────────┤
│ 50         │ 50           │
├────────────┼──────────────┤
│ 75         │ 75           │
├────────────┼──────────────┤
│ 90         │ 92           │
├────────────┼──────────────┤
│ 97.5       │ 105          │
├────────────┼──────────────┤
│ 99         │ 198          │
├────────────┼──────────────┤
│ 99.9       │ 466          │
├────────────┼──────────────┤
│ 99.99      │ 493          │
├────────────┼──────────────┤
│ 99.999     │ 497          │
└────────────┴──────────────┘

906 requests in 300.14s, 30.3 MB read

Memory usage (after load test): 4096MB
Memory increase during load test: +3893MB