output_7_render_perf/waiting-result-go-chromedp.log
Go PDF Service (chromedp) Headers:
==================================
HTTP/1.1 200 OK
Content-Length: 27744
Content-Type: application/pdf
X-Browser-Product: 1.3
X-Browser-Protocolversion: Chrome/141.0.7378.4
X-Browser-Revision: @e6c0fee546ab31f9b21af777cb3083143551ab0f
Date: Tue, 02 Sep 2025 10:50:59 GMT



Performance Metrics:
===================
Container image size: 366MB
Average startup time: 247ms (10 iterations)
Memory usage (before load test): 206MB
Memory usage (after single PDF): 383MB
Memory increase from single PDF: +177MB


Load Test Results:
==================
Running 300s test @ http://127.0.0.1:5011/pdf
3 connections with 3 pipelining factor


┌─────────┬───────┬─────────┬─────────┬─────────┬────────────┬───────────┬─────────┐
│ Stat    │ 2.5%  │ 50%     │ 97.5%   │ 99%     │ Avg        │ Stdev     │ Max     │
├─────────┼───────┼─────────┼─────────┼─────────┼────────────┼───────────┼─────────┤
│ Latency │ 62 ms │ 1229 ms │ 2400 ms │ 2439 ms │ 1229.86 ms │ 710.29 ms │ 2630 ms │
└─────────┴───────┴─────────┴─────────┴─────────┴────────────┴───────────┴─────────┘
┌───────────┬───────┬───────┬───────┬───────┬───────┬─────────┬───────┐
│ Stat      │ 1%    │ 2.5%  │ 50%   │ 97.5% │ Avg   │ Stdev   │ Min   │
├───────────┼───────┼───────┼───────┼───────┼───────┼─────────┼───────┤
│ Req/Sec   │ 1     │ 1     │ 3     │ 3     │ 2.44  │ 0.65    │ 1     │
├───────────┼───────┼───────┼───────┼───────┼───────┼─────────┼───────┤
│ Bytes/Sec │ 28 kB │ 28 kB │ 84 kB │ 84 kB │ 68 kB │ 18.1 kB │ 28 kB │
└───────────┴───────┴───────┴───────┴───────┴───────┴─────────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 300

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 1            │
├────────────┼──────────────┤
│ 0.01       │ 1            │
├────────────┼──────────────┤
│ 0.1        │ 3            │
├────────────┼──────────────┤
│ 1          │ 25           │
├────────────┼──────────────┤
│ 2.5        │ 62           │
├────────────┼──────────────┤
│ 10         │ 246          │
├────────────┼──────────────┤
│ 25         │ 615          │
├────────────┼──────────────┤
│ 50         │ 1229         │
├────────────┼──────────────┤
│ 75         │ 1844         │
├────────────┼──────────────┤
│ 90         │ 2214         │
├────────────┼──────────────┤
│ 97.5       │ 2400         │
├────────────┼──────────────┤
│ 99         │ 2439         │
├────────────┼──────────────┤
│ 99.9       │ 2487         │
├────────────┼──────────────┤
│ 99.99      │ 2542         │
├────────────┼──────────────┤
│ 99.999     │ 2613         │
└────────────┴──────────────┘

741 requests in 300.42s, 20.4 MB read

Memory usage (after load test): 1024MB
Memory increase during load test: +818MB